# 같은 형식의 데이터 합치기 : concat()

### 1. concat(axis=0일 때)

-	개념: `여러 개의 DataFrame을 위아래로 연결`하여 하나로 합칠 때 `concat()` 함수를 사용할 수 있습니다.

In [1]:
import pandas as pd

english_df1 = pd.DataFrame({
    'name': ['dongwook', 'taeho', 'jimin'],
    'english_score': [50, 89, 68]
})

english_df2 = pd.DataFrame({
    'name': ['yoonsoo', 'sowon', 'haeun'],
    'english_score': [88, 91, 72]
})

In [2]:
english_df1

       name  english_score
0  dongwook             50
1     taeho             89
2     jimin             68

In [3]:
english_df2

      name  english_score
0  yoonsoo             88
1    sowon             91
2    haeun             72

In [4]:
# 두 개의 DataFrame을 위아래로 합치기
pd.concat([english_df1, english_df2], axis=0)

       name  english_score
0  dongwook             50
1     taeho             89
2     jimin             68
0   yoonsoo             88
1     sowon             91
2     haeun             72

-	기본적으로 인덱스가 유지되지만, `ignore_index=True`로 설정하면 `인덱스가 새로 부여`됩니다.

In [5]:
# 인덱스를 무시하고 0부터 새로 부여
pd.concat([english_df1, english_df2], ignore_index=True)

# 합친 결과를 새로운 변수에 저장
english_df = pd.concat([english_df1, english_df2], ignore_index=True)
english_df

       name  english_score
0  dongwook             50
1     taeho             89
2     jimin             68
3   yoonsoo             88
4     sowon             91
5     haeun             72

In [6]:
math_df = pd.DataFrame({
    'name': ['dongwook', 'taeho', 'jimin', 'yoonsoo', 'sowon', 'haeun'],
    'math_score': [86, 31, 91, 75, 68, 80]
})

In [8]:
math_df

       name  math_score
0  dongwook          86
1     taeho          31
2     jimin          91
3   yoonsoo          75
4     sowon          68
5     haeun          80

### 2. concat(axis=1일 때)

-	개념: 여러 개의 DataFrame을 `옆으로 연결`할 때 concat() 함수의 `axis=1 옵션`을 사용합니다.
- 행의 개수가 같아야만 쓸 수 있기 때문에 사실상 거의 쓸 일 없음

In [10]:
pd.concat([english_df, math_df], axis=1)

       name  english_score      name  math_score
0  dongwook             50  dongwook          86
1     taeho             89     taeho          31
2     jimin             68     jimin          91
3   yoonsoo             88   yoonsoo          75
4     sowon             91     sowon          68
5     haeun             72     haeun          80

-	`기본값인 axis=0은 위아래`로 합치지만, `axis=1`을 사용하면 각 컬럼을 기준으로 데이터를 `옆으로 확장`할 수 있습니다.